InformationRegisters/Цены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>Цены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Корреспонденция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

InformationRegisters/ЗаказныеЦены.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.15">
	<InformationRegister>
		<Properties>
			<Name>ЗаказныеЦены</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Стоимость</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Корреспонденция</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Корреспонденция</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

CommonModules/РаботаСЦенами/Ext/Module.bsl
Функция Цена(Дата, ЭлементНоменклатуры) Экспорт
	Отбор = Новый Структура("Корреспонденция", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.Цены.ПолучитьПоследнее(Дата,Отбор);
    Возврат ЗначениеРесурсов.Стоимость;	 
КонецФункции

Функция ЗаказНаЦеныПолучить(Дата, ЭлементНоменклатуры) Экспорт
	Отбор = Новый Структура("Корреспонденция", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.ЗаказныеЦены.ПолучитьПоследнее(Дата,Отбор);
    Возврат ЗначениеРесурсов.Стоимость;	 
КонецФункции         
Функция Ценность(Дата, ЭлементНоменклатуры) Экспорт
	Отбор = Новый Структура("ВидЦенности", ЭлементНоменклатуры);
	ЗначениеРесурсов = РегистрыСведений.ВидЦенности.ПолучитьПоследнее(Дата,Отбор);
    Возврат ЗначениеРесурсов.Стоимость;	 
	КонецФункции
